
rozyminsk_popup = f'''Магазин: rozyminsk.by
                            Время работы:
                            пн-вс:10:00-20:00
                            Адрес: '''
rozyminsk_locations = [
            [53.9077,27.48463,f'{rozyminsk_popup} ул.Притыцкого,29']
            ]

daflor_popup = f'''Магазин: daflor.by
                            Время работы:
                            пн-вс:10:00-21:00
                            Адрес: '''

daflor_loactoins = [
    [53.885703,27.514966,f'{daflor_popup} ул. Щорса, 11'],
    [53.865499,27.485564,f'{daflor_popup} пр-т Дзержинского, 94']

    ]

rosesbel_popup = f'''Магазин: Розы.бел
                            Время работы:
                            Пн-суб:07:00-23:00
                            Воскр:07:00-21:00
                            Адрес: '''
rosesbel_locations = [
            [53.862977,27.488304,f'{rosesbel_popup} пр-т.Дзержинского,77А (Дисконт-центр 24/7)'],
            [53.845599,27.475826,f'{rosesbel_popup} пр-т.Дзержинского,127, подъезд 3'],
            [53.879429,27.602471,f'{rosesbel_popup} Партизанский пр-т.,14'],
            [53.944696,27.690416,f'{rosesbel_popup} пр-т.Независимости,172'],
            [53.907854,27.547108, f'{rosesbel_popup} ул.Димитрова,5'],
            [53.939948,27.59859,f'{rosesbel_popup} ул.Восточная,131'],
            [53.908076,27.428512, f'{rosesbel_popup} ул.Притыцкого,158'],
            [53.90718,27.478746, f'{rosesbel_popup} ул.Бельского,6'],
            [53.845488,27.529941, f'{rosesbel_popup} ул.Корженевского,51'],
            [53.869364,27.650243, f'{rosesbel_popup} Партизанский пр-т.,107'],
            [53.932972,27.653163, f'{rosesbel_popup} ул.Петра Мстиславца,22'],
            [53.869274,27.599435,f'{rosesbel_popup} пр-т.Рокоссовского,18а (рядом с Палессе)'],
            [53.942847,27.461804,f'{rosesbel_popup} пр-т.Победителей,135А'],
            [53.845206,27.568227,f'{rosesbel_popup} Игуменский тракт,16'],
            [53.911015,27.494529,f'{rosesbel_popup} пр-т.Пушкина,43А'],
            [53.909705,27.420634,f'{rosesbel_popup} ул.Нёманская,3'],
            [53.855675,27.478638,f'{rosesbel_popup} пр-т.Дзержинского,115'],
            [53.931652,27.655157,f'{rosesbel_popup} ул.Туровского,12 пом.133'],
            [53.869784,27.549991,f'{rosesbel_popup} пр-т.Мира,1'],
            [53.883543,27.448068,f'{rosesbel_popup} ул.Шаранговича,25'],
            [54.00368,27.67722,f'{rosesbel_popup} д.Боровляны, ул.Березовая Роща,108']
                ]

orsrose_popup = f'''Магазин: Дорорс Время работы: 
                    9:00-20:00
                    Адрес: '''

orsrose_locations = [
                [53.89308060946698,27.552455010254647,f'{orsrose_popup} ул.Кирова,4'],
                [53.88478273843963,27.541250050260828,f'{orsrose_popup} ул.Слонимская,1'],
                [53.88962683106312,27.549161364417888,f'{orsrose_popup} ул.Вокзальная,26A']
                ]

imflowers_popup = f'''Магазин: Долина роз
                            +375 29 85-85-3-85
                            Время работы:
                            пн-вс:09:00-21:00
                            Адрес: '''
imflowers_locations = [
            [53.855675,27.478638,f'{imflowers_popup} пр-т. Дзержинского 115'],
            [53.931652,27.655157,f'{imflowers_popup} ул. Туровского 12 пом. 133'],
            [53.909705,27.420634,f'{imflowers_popup} ул. Неманская 3'],
            [55.77315,37.631775,f'{imflowers_popup} Пр-т Мира, 1']
            ]